alwin-middleware-grapescode/alwin-rest/src/test/resources/messages/response/invoice/allInvoiceSortedByDueDateAscending.json

{
  "invoices": {
    "values": [
      {
        "id": 3,
        "lastPaymentDate": 1447369200000,
        "netAmount": 490.73,
        "grossAmount": 490.73,
        "number": "000006/11/2015/RL/PO/LW",
        "currency": "EUR",
        "currentBalance": 100.00,
        "paid": 10.00,
        "contractNumber": "issue_21_00001/15/1",
        "typeId": 3,
        "dueDate": 1447110000000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 3,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": false,
        "issueDate": 1448924400000
      },
      {
        "id": 2,
        "lastPaymentDate": 1449702000000,
        "netAmount": 375.00,
        "grossAmount": 461.25,
        "number": "000016/12/2015/TO",
        "currency": "PLN",
        "currentBalance": 0.00,
        "paid": 0.00,
        "contractNumber": "issue_21_00001/15/1",
        "typeId": 5,
        "dueDate": 1449702000000,
        "typeLabel": "Oplata dodatkowa",
        "excluded": true,
        "dpd": 0,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": false,
        "issueDate": 1449702000000
      },
      {
        "id": 12,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/07/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 24.20,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1593640800000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1471,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 10,
        "lastPaymentDate": null,
        "netAmount": 154.66,
        "grossAmount": 190.23,
        "number": "000001/12/2020/RL/PO/LW",
        "currency": "EUR",
        "currentBalance": -190.23,
        "paid": 90.32,
        "contractNumber": "issue_21_00001/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 13,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/08/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 0.00,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      }
    ],
    "totalValues": 8
  },
  "balance": -338.47
}