alwin-middleware-grapescode/alwin-rest/src/test/resources/messages/response/invoice/firstPageOfInvoiceNotPaidAndOverdue.json

{
  "invoices": {
    "values": [
      {
        "id": 10,
        "lastPaymentDate": null,
        "netAmount": 154.66,
        "grossAmount": 190.23,
        "number": "000001/12/2020/RL/PO/LW",
        "currency": "EUR",
        "currentBalance": -190.23,
        "paid": 90.32,
        "contractNumber": "issue_21_00001/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 12,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/07/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 24.20,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1593640800000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1471,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 13,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/08/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 0.00,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 14,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/09/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 0.00,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1606863600000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1318,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": false,
        "issueDate": null
      },
      {
        "id": 15,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/10/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 0.00,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      }
    ],
    "totalValues": 5
  },
  "balance": -686.71
}
