alwin-middleware-grapescode/alwin-rest/src/test/resources/messages/response/invoice/firstPageOfOverdueIssueInvoicesSortedByDueDateDescending.json

{
  "invoices": {
    "values": [
      {
        "id": 11,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/10/2024/RL/PO/LW",
        "currency": "EUR",
        "currentBalance": -124.12,
        "paid": 24.21,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1727820000000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": -82,
        "correction": false,
        "corrections": [
          {
            "id": 31,
            "lastPaymentDate": null,
            "netAmount": 310.00,
            "grossAmount": 381.30,
            "number": "000031/12/2015/KF",
            "currency": "PLN",
            "currentBalance": 0.00,
            "paid": 0.00,
            "contractNumber": "001148/15/1",
            "typeId": 5,
            "dueDate": 1446246000000,
            "typeLabel": "Oplata dodatkowa",
            "excluded": false,
            "dpd": 0,
            "correction": true,
            "corrections": [],
            "correctionOrder": 1,
            "issueSubject": false,
            "issueDate": null,
            "previousCorrectionGrossAmountDiff": 257.18,
            "rootInvoiceGrossAmountDiff": 257.18
          },
          {
            "id": 29,
            "lastPaymentDate": null,
            "netAmount": 290.00,
            "grossAmount": 356.70,
            "number": "000029/12/2015/KF",
            "currency": "PLN",
            "currentBalance": 0.00,
            "paid": 0.00,
            "contractNumber": "001148/15/1",
            "typeId": 5,
            "dueDate": 1446073200000,
            "typeLabel": "Oplata dodatkowa",
            "excluded": false,
            "dpd": 0,
            "correction": true,
            "corrections": [],
            "correctionOrder": 2,
            "issueSubject": false,
            "issueDate": null,
            "previousCorrectionGrossAmountDiff": -24.60,
            "rootInvoiceGrossAmountDiff": 232.58
          },
          {
            "id": 30,
            "lastPaymentDate": null,
            "netAmount": 0.00,
            "grossAmount": 0.00,
            "number": "000030/12/2015/KF",
            "currency": "PLN",
            "currentBalance": 0.00,
            "paid": 0.00,
            "contractNumber": "001148/15/1",
            "typeId": 5,
            "dueDate": 1446159600000,
            "typeLabel": "Oplata dodatkowa",
            "excluded": false,
            "dpd": 0,
            "correction": true,
            "corrections": [],
            "correctionOrder": 3,
            "issueSubject": false,
            "issueDate": null,
            "previousCorrectionGrossAmountDiff": -356.70,
            "rootInvoiceGrossAmountDiff": -124.12
          }
        ],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 14,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/09/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 0.00,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1606863600000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1318,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": false,
        "issueDate": null
      },
      {
        "id": 10,
        "lastPaymentDate": null,
        "netAmount": 154.66,
        "grossAmount": 190.23,
        "number": "000001/12/2020/RL/PO/LW",
        "currency": "EUR",
        "currentBalance": -190.23,
        "paid": 90.32,
        "contractNumber": "issue_21_00001/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 13,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/08/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 0.00,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      },
      {
        "id": 15,
        "lastPaymentDate": null,
        "netAmount": 100.91,
        "grossAmount": 124.12,
        "number": "000001/10/2020/RL/PO/LW",
        "currency": "PLN",
        "currentBalance": -124.12,
        "paid": 0.00,
        "contractNumber": "issue_21_00002/15/1",
        "typeId": 3,
        "dueDate": 1606777200000,
        "typeLabel": "Oplata okresowa",
        "excluded": false,
        "dpd": 1319,
        "correction": false,
        "corrections": [],
        "correctionOrder": null,
        "issueSubject": true,
        "issueDate": null
      }
    ],
    "totalValues": 6
  },
  "balance": -686.71
}